@alexhung  No that understanding is not correct. I have a TF config like this : 

``` Terraform
resource "xray_ignore_rule" "ignore_rule" {
  notes           = "delete me now test ignore rule iac"
  vulnerabilities = ["XRAY-170461"]
}
```

-  I do an import and then i get state file like this 
``` Terraform 
"instances": [
  {
    "schema_version": 0,
    "attributes": {
      ...
      "cves": null,
      ...
    }
  }
]
```

- then I do plan to make sure thing align and I get 
``` Log 
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # xray_ignore_rule.ignore_rule must be replaced
-/+ resource "xray_ignore_rule" "ignore_rule" {
      ~ author          = "someauthor" -> (known after apply)
      ~ created         = "2023-11-17T18:30:29Z" -> (known after apply)
      + cves            = (known after apply) # forces replacement
      ~ id              = "91ced9b-bb1e-4d9c-488c-6bf093a36d64" -> (known after apply)
      ~ is_expired      = false -> (known after apply)
        # (4 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ author     = "someauthor" -> (known after apply)
  ~ created    = "2023-11-17T18:30:29Z" -> (known after apply)
  ~ id         = "91ced9b-bb1e-4d9c-488c-6bf093a36d64" -> (known after apply)
  ~ is_expired = false -> (known after apply)

```

- When I go ahead to apply : I get this state file 

``` Terraform 
"instances": [
  {
    "schema_version": 0,
    "attributes": {
      ...
      "cves": [],
      ...
    }
  }
]
```


What could have stopped the difference would have been me been able to give `cves` value as `[]` but then I am running into that conflict error which does not seems to be a conflict as `cves            = []` is not same as `vulnerabilities = ["XRAY-170461"]` 


The only work around which I could think of was to change the state file manual by making `cves=[]`. that resulted in `No changes. Your infrastructure matches the configuration.` but of course this is a bad practice and state file should never be manually updated. 
